zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_control.c
    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
        const cy_stc_capsense_common_config_t * ptrCommonCfg;
    #endif

    if (NULL != context)
    {
        context->ptrCommonContext->mwVersionMajor = CY_CAPSENSE_MW_VERSION_MAJOR;
        context->ptrCommonContext->mwVersionMinor = CY_CAPSENSE_MW_VERSION_MINOR;

        ptrInternalCxt = context->ptrInternalContext;
        ptrInternalCxt->intrCsdInactSnsConn = CY_CAPSENSE_SNS_CONNECTION_UNDEFINED;
        ptrInternalCxt->intrCsxInactSnsConn = CY_CAPSENSE_SNS_CONNECTION_UNDEFINED;
        #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
            ptrInternalCxt->intrWbxInactSnsConn = CY_CAPSENSE_SNS_CONNECTION_UNDEFINED;
        #endif

        ptrInternalCxt->ptrSSCallback = NULL;
        ptrInternalCxt->ptrEOSCallback = NULL;
        ptrInternalCxt->ptrTunerReceiveCallback = NULL;
        ptrInternalCxt->ptrTunerSendCallback = NULL;

        ptrWdCxt = context->ptrWdConfig->ptrWdContext;
        for (wdIndex = 0u; wdIndex < CY_CAPSENSE_TOTAL_WIDGET_COUNT; wdIndex++)
        {
            ptrWdCxt->status |= (uint32_t)((uint32_t)CY_CAPSENSE_WD_ENABLE_MASK | (uint32_t)CY_CAPSENSE_WD_WORKING_MASK);
            ptrWdCxt++;
        }

        #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
            /* Set the maximum refresh rate (default value) for ACTIVE scan mode */
            ptrInternalCxt->activeWakeupTimer = 0u;
            /* Set default compensation factor for nominal ILO frequency (40KHz) */
            ptrInternalCxt->iloCompensationFactor = CY_CAPSENSE_DEFAULT_ILO_FACTOR;
        #endif

        #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
            ptrCommonCfg = context->ptrCommonConfig;
            ptrInternalCxt->ptrEODsInitCallback = NULL;
            ptrInternalCxt->intrIsxInactSnsConn = CY_CAPSENSE_SNS_CONNECTION_UNDEFINED;
            ptrInternalCxt->intrCsdRawTarget = ptrCommonCfg->csdRawTarget;
            ptrInternalCxt->intrCsxRawTarget = ptrCommonCfg->csxRawTarget;
            ptrInternalCxt->intrIsxRawTarget = ptrCommonCfg->isxRawTarget;
            ptrInternalCxt->intrWbxRawTarget = ptrCommonCfg->wbxRawTarget;
            ptrInternalCxt->numCoarseInitChargeCycles = ptrCommonCfg->numCoarseInitChargeCycles;
            ptrInternalCxt->numCoarseInitSettleCycles = ptrCommonCfg->numCoarseInitSettleCycles;
            ptrInternalCxt->numProOffsetCycles = ptrCommonCfg->numProOffsetCycles;
            ptrInternalCxt->proOffsetCdacComp = ptrCommonCfg->proOffsetCdacComp;

            ptrInternalCxt->lfsrPoly = CY_CAPSENSE_LFSR_POLY;
            ptrInternalCxt->lfsrScale = CY_CAPSENSE_LFSR_SCALE;
            ptrInternalCxt->cdacDitherSeed = CY_CAPSENSE_CDAC_DITHER_SEED;
            ptrInternalCxt->cdacDitherPoly = CY_CAPSENSE_CDAC_DITHER_POLY;
            ptrInternalCxt->modClk = CY_CAPSENSE_MODCLK_DIV;

            ptrWdCxt = context->ptrWdConfig->ptrWdContext;
            for (wdIndex = 0u; wdIndex < CY_CAPSENSE_TOTAL_WIDGET_COUNT; wdIndex++)
            {
                if (0u == ptrWdCxt->maxRawCount)
                {
                    ptrWdCxt->status |= (uint32_t)CY_CAPSENSE_WD_MAXCOUNT_CALC_MASK;
                }
                if (0u == ptrWdCxt->maxRawCountRow)
                {
                    ptrWdCxt->status |= (uint32_t)CY_CAPSENSE_WD_MAXCOUNT_ROW_CALC_MASK;
                }
                ptrWdCxt++;
            }

            #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
                ptrInternalCxt->numEpiCycles = ptrCommonCfg->numEpiCycles;
                ptrInternalCxt->numFineInitWaitCycles = CY_CAPSENSE_NUM_FINE_INIT_WAIT_CYCLES;
                ptrInternalCxt->numFineInitCycles = CY_CAPSENSE_NUM_FINE_INIT_CYCLES;

                #if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                    /* Set undefined value to initiate DMA configuration in Cy_CapSense_ScanSlots() function */
                    ptrInternalCxt->currentSlotIndex = CY_CAPSENSE_SLOT_COUNT_MAX_VALUE;
                    (void)Cy_CapSense_InitializeDmaArrays(context);
                #endif
            #endif

            #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
                ptrInternalCxt->numProWaitKrefDelay = ptrCommonCfg->numProWaitKrefDelay;
                ptrInternalCxt->numProWaitKrefDelayPrs = ptrCommonCfg->numProWaitKrefDelayPrs;
                ptrInternalCxt->numEpiKrefDelay = ptrCommonCfg->numEpiKrefDelay;
                ptrInternalCxt->numEpiKrefDelayPrs = ptrCommonCfg->numEpiKrefDelayPrs;
                ptrInternalCxt->mrssStateAfterScan = CY_CAPSENSE_MRSS_TURN_OFF;

                ptrInternalCxt->numFineInitCycles = CY_CAPSENSE_NUM_FINE_INIT_CYCLES;
                ptrInternalCxt->csdCdacDitherEn = CY_CAPSENSE_CSD_CDAC_DITHER_EN;
                ptrInternalCxt->csxCdacDitherEn = CY_CAPSENSE_CSX_CDAC_DITHER_EN;
                ptrInternalCxt->isxCdacDitherEn = CY_CAPSENSE_ISX_CDAC_DITHER_EN;
                ptrInternalCxt->bslnCoefSlow = CY_CAPSENSE_BSLN_COEFF_SLOW;
                ptrInternalCxt->bslnCoefFast = CY_CAPSENSE_BSLN_COEFF_FAST;
                ptrInternalCxt->bslnUpdateDelay = CY_CAPSENSE_BSLN_UPDATE_DELAY;
                ptrInternalCxt->iirCoeffLp = CY_CAPSENSE_IIR_COEFF_LP;
                ptrInternalCxt->wotScanInterval = CY_CAPSENSE_WOT_SCAN_INTERVAL;
                ptrInternalCxt->wotTimeout = CY_CAPSENSE_WOT_TIMEOUT;

                /* Set CDAC trim coefficient */
                cdacTrimCoeff = (uint16_t)((((uint16_t)(((SFLASH_Type *) SFLASH)->CREF_COEFF1)) << 8u) | 
                                            ((uint16_t)(((SFLASH_Type *) SFLASH)->CREF_COEFF0)));
                /* Adding correction to 90% */
                cdacTrimCoeff *= CY_CAPSENSE_CDAC_TRIM_CORRECTION_NUMERATOR;
                cdacTrimCoeff += (CY_CAPSENSE_CDAC_TRIM_CORRECTION_DENOMINATOR >> 1u);
                cdacTrimCoeff /= CY_CAPSENSE_CDAC_TRIM_CORRECTION_DENOMINATOR;

                context->ptrCommonContext->cdacTrimCoefficient = (uint16_t)cdacTrimCoeff;
            #endif

