zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_control.c
            result = Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_UNDEFINED, context);

            if (CY_CAPSENSE_STATUS_SUCCESS == result)
            {
                result = Cy_CapSense_Restore(context);
            }
        #endif

        #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
            result = Cy_CapSense_Restore(context);
        #endif
    }

    return result;
}


/*******************************************************************************
* Function Name: Cy_CapSense_Enable
****************************************************************************//**
*
* Initializes the CAPSENSE&trade; firmware modules.
*
* Call the Cy_CapSense_Init() function and configure CAPSENSE&trade; HW block interrupts
* prior to calling this function.
* See the function usage example below for details on usage.
*
* The following are executed as part of the function:
* 1. Check CAPSENSE&trade; configuration integrity.
* 2. Pre-calculate of internal register values to speed up operation.
* 3. Configure the CAPSENSE&trade; HW block to perform capacitive sensing operation.
* 4. If the smart sensing algorithm is selected in the
*    Basic tab, the auto-tuning functionality is executed to set the optimal
*    values for the CAPSENSE&trade; HW block parameters of the widgets/sensors.
* 5. Calibrate the sensors and find the optimal values for DACs of each widget/sensor,
*    if the auto-calibration is enabled in the CSD Settings, CSX Settings or ISX Settings tabs.
* 6. Perform scanning for all the sensors and initialize the baseline history.
* 7. If the firmware filters are enabled in the Advanced General tab, the
*    filter histories are also initialized.
*
* Any subsequent call of this function repeats the initialization process.
* Therefore, it is possible to change the middleware configuration
* from the application program by writing registers to the data structure
* and calling this function again.
*
* The repeated call of this function is also done inside the
* Cy_CapSense_RunTuner() function when a restart command is received.
*
* The function calls the Cy_CapSense_ScanAllWidgets() function to proper
* baseline setup.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the initialization process. If CY_CAPSENSE_STATUS_SUCCESS is not
* received, some of the initialization fails.
*
* \funcusage
*
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_Initialization
* The 'cy_capsense_context' variable that is used as the parameter of the
* Cy_CapSense_Init() and Cy_CapSense_Enable() functions is declared in the
* cycfg_capsense.h file.
*
* The CapSense_ISR_cfg variable should be declared by the application
* program according to the examples below:<br>
* For CM0+ core:
* \snippet capsense/snippet/main.c snippet_m0p_capsense_interrupt_source_declaration
* \note MSCLP HW contains two interrupt sources.
* The CAPSENSE&trade; Middleware supports only the msclp_interrupt_<b>lp</b>_IRQn 
* vector and therefore it should be used.
*
* For CM4 core:
* \snippet capsense/snippet/main.c snippet_m4_capsense_interrupt_source_declaration
*
* The CAPSENSE&trade; interrupt handler should be declared by the application program
* according to the example below:
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_IntHandler
*
* The CapSense_HW is the pointer to the base register address of
* the CAPSENSE&trade; HW block. A macro for the pointer is in the cycfg_peripherals.h
* file defined as \<Personality_Name\>_HW. If no name is specified,
* the following default names are used:
* * csd_\<Block_Number\>_csd_\<Block_Number\>_HW - for forth-generation CAPSENSE&trade; HW.
* * msc_\<Block_Number\>_msc_\<Block_Number\>_HW - for fifth-generation CAPSENSE&trade; HW.
* * msclp_\<Block_Number\>_msclp_\<Block_Number\>_HW - for fifth-generation low power CAPSENSE&trade; HW.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_Enable(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t result;
    uint32_t cpuFreqMHz;
    uint32_t watchdogCounter;
    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
        context->ptrCommonContext->status |= CY_CAPSENSE_MW_STATE_INITIALIZATION_MASK;
        uint32_t widgetId;
    #endif

    /* Approximate duration of Wait For Init loop */
    const uint32_t isBusyLoopDuration = 5uL;

    /* Wait For Init watchdog timeout in microseconds */
    const uint32_t isBusyWatchdogTimeUs = 1000000uL;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_RC_HW_IIR_FILTER_EN)
        context->ptrInternalContext->hwIirInit = 0u;
        (void)Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_CAPTURED_DEFAULT, context);
    #endif

    /* Initialize CAPSENSE&trade; modules */
    result = Cy_CapSense_Initialize(context);

    if (CY_CAPSENSE_STATUS_SUCCESS == result)
    {
        #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_EN)
                result |= Cy_CapSense_SsAutoTune(context);
            #elif (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN)
                result |= Cy_CapSense_CalibrateAllCsdWidgets(context);
            #endif

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN)
                result |= Cy_CapSense_CalibrateAllCsxWidgets(context);
            #endif
        #elif (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_EN)
                result |= Cy_CapSense_SsAutoTune(context);
            #endif
            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN))
                result |= Cy_CapSense_CalibrateAllSlots(context);
            #endif
        #else /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_EN)
                result |= Cy_CapSense_SsAutoTune(context);
            #endif
            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN) || \
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CALIBRATION_EN) || \
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CALIBRATION_EN))
                {
                    result |= Cy_CapSense_CalibrateAllSlots(context);
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
                        result |= Cy_CapSense_CalibrateAllLpSlots(context);
                    #endif /* CY_CAPSENSE_LP_EN */
                }
            #endif
        #endif

        /* Scan each widget separately if the MPSC is enabled */
        #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED) || \
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LIQUID_LEVEL_FOAM_DETECTION_EN) || \
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN))
                for (widgetId = 0u; widgetId < CY_CAPSENSE_TOTAL_WIDGET_COUNT; widgetId++)
                {
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_LP_EN)
                        if ((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E != context->ptrWdConfig[widgetId].wdType)
                    #endif
                    {
                        result |= Cy_CapSense_ScanWidget(widgetId, context);
                    }
                    result |= Cy_CapSense_WaitEndScan(1000000uL, context);  /* 1sec timeout per widget */
                }
            #else
                result |= Cy_CapSense_ScanAllWidgets(context);
            #endif /* CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED */
        #else
            result |= Cy_CapSense_ScanAllWidgets(context);
        #endif /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP */

        /* Init Watchdog Counter to prevent a hang */
        cpuFreqMHz = context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA;
        watchdogCounter = Cy_CapSense_WatchdogCyclesNum(isBusyWatchdogTimeUs, cpuFreqMHz, isBusyLoopDuration);

        while (CY_CAPSENSE_NOT_BUSY != Cy_CapSense_IsBusy(context))
        {
            if (0uL == watchdogCounter)
            {
                result = CY_CAPSENSE_STATUS_TIMEOUT;
                break;
            }

            watchdogCounter--;
        }

        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_RC_HW_IIR_FILTER_EN)
            context->ptrInternalContext->hwIirInit = (uint8_t)MSCLP_CE_CTL_RCF_EN_Msk;
            (void)Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_CAPTURED_DEFAULT, context);
        #endif

