zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_control.c
        #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
            for (widgetId = 0u; widgetId < CY_CAPSENSE_TOTAL_WIDGET_COUNT; widgetId++)
            {
                Cy_CapSense_PreProcessWidget(widgetId, context);
                #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
                        if (((CY_CAPSENSE_MPSC_MIN_ORDER <= context->ptrWdConfig[widgetId].mpOrder) ||
                             (CY_CAPSENSE_MPSC_MIN_ORDER <= context->ptrWdConfig[widgetId].mpOrderRows)) &&
                             (CY_CAPSENSE_CSD_GROUP == context->ptrWdConfig[widgetId].senseMethod))
                        {
                            result |= Cy_CapSense_ProcessWidgetMpDeconvolution(widgetId, context);
                        }
                    #endif
                #endif
                #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_TX_ENABLED)
                        if ((CY_CAPSENSE_MPTX_MIN_ORDER <= context->ptrWdConfig[widgetId].mpOrder) &&
                            (CY_CAPSENSE_CSX_GROUP == context->ptrWdConfig[widgetId].senseMethod))
                        {
                            result |= Cy_CapSense_ProcessWidgetMpDeconvolution(widgetId, context);
                        }
                    #endif
                #endif
            }
        #endif
    }

    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_RAWCOUNT_FILTER_EN)
        Cy_CapSense_InitializeAllFilters(context);
    #endif
    result |= Cy_CapSense_InitializeAllBaselines(context);

    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
        context->ptrCommonContext->status &= ~(uint32_t)CY_CAPSENSE_MW_STATE_INITIALIZATION_MASK;
    #endif

    return result;
}


/*******************************************************************************
* Function Name: Cy_CapSense_Initialize
****************************************************************************//**
*
* Initializes all sub-modules of the CAPSENSE&trade; middleware.
*
* The initialization includes:
* - Data Structure - set the default middleware parameters based
*   on configuration.
* - Data Processing - resets the status all widgets.
* - Tuner - resets the tuner communication state.
* - Sensing - prepares the CAPSENSE&trade; HW blocks for operation.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Return CY_CAPSENSE_STATUS_SUCCESS if the initialization was successful.
* If CY_CAPSENSE_STATUS_SUCCESS is not received, some of the initialization
* fails.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_Initialize(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t result;

    result = Cy_CapSense_CheckConfigIntegrity(context);
    if (CY_CAPSENSE_STATUS_SUCCESS == result)
    {
        Cy_CapSense_InitializeAllStatuses(context);

        result |= Cy_CapSense_SsInitialize(context);

        /* The Tuner and the BIST are initialized only once */
        if (CY_CAPSENSE_INIT_NEEDED == context->ptrCommonContext->initDone)
        {
            Cy_CapSense_TuInitialize(context);

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN)
                Cy_CapSense_BistDsInitialize(context);
            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) */

            context->ptrCommonContext->initDone = CY_CAPSENSE_INIT_DONE;
        }
    }

    return result;
}


/*******************************************************************************
* Function Name: Cy_CapSense_DeInit
****************************************************************************//**
*
* Stops the middleware operation and releases the CAPSENSE&trade; captured HW blocks.
*
* No sensor scanning can be executed when the middleware is stopped.
* This function should be called only when no scanning is in progress.
* I.e. Cy_CapSense_IsBusy() returns a non-busy status.
*
* After the middleware stops, the CAPSENSE&trade; HW block(s) may be reconfigured with the
* application program or other middleware for any other usage.
*
* When the middleware operation is stopped by the Cy_CapSense_DeInit()
* function, subsequent call of the Cy_CapSense_Init() function repeats
* the initialization process, so a subsequent call of the Cy_CapSense_Enable()
* function is not required. However, to implement Time-multiplexed mode
* (sharing the CAPSENSE&trade; HW block(s) between multiple middleware)
* the Cy_CapSense_Save() and Cy_CapSense_Restore() functions should be used
* instead of the Cy_CapSense_DeInit() and Cy_CapSense_Init() functions for
* further compatibility.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the stop process. If CY_CAPSENSE_STATUS_SUCCESS is not received,
* the stop process fails and retries may be required.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_DeInit(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t result;

    result = Cy_CapSense_Save(context);
    if (CY_CAPSENSE_STATUS_SUCCESS != result)
    {
        result = CY_CAPSENSE_STATUS_BAD_DATA;
    }
    else
    {
        context->ptrCommonContext->initDone = CY_CAPSENSE_INIT_NEEDED;
    }

    return result;
}


/*******************************************************************************
* Function Name: Cy_CapSense_ProcessAllWidgets
****************************************************************************//**
*
* Performs full data processing of all enabled widgets.
*
* This function performs all data processes for all enabled widgets and
* sensors in the middleware to produce meaningful status output from widgets
* and sensors. The following tasks are executed as part of processing all the
* widgets:
* 1. Apply raw count filters to the raw counts, if they are enabled.
* 2. Update the thresholds if the smart sensing algorithm Full auto-tuning
*    is enabled.
* 3. Update the baselines and difference counts for all the sensors.
* 4. Update the sensor and widget output status. Updates on/off status for
*    buttons and proximity widgets, centroid/position for
*    the sliders and the X/Y position for the touchpads,
*    liquid level calculation for liquid level widgets.
*
* This function is called by the application program only after all the enabled
* widgets (and sensors) in the middleware are scanned. Calling this function
* multiple times without sensor scanning causes unexpected behavior.
*
* Disabled and/or non-working widgets are not processed by this function.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the processing operation. If CY_CAPSENSE_STATUS_SUCCESS
* is not received, the processing fails and retries may be required.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ProcessAllWidgets(cy_stc_capsense_context_t * context)
{
    uint32_t wdIndex;
    cy_capsense_status_t result = CY_CAPSENSE_STATUS_SUCCESS;

    for (wdIndex = 0u; wdIndex < CY_CAPSENSE_TOTAL_WIDGET_COUNT; wdIndex++)
    {
        if (0u != Cy_CapSense_IsWidgetEnabled(wdIndex, context))
        {
            #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP && (CY_CAPSENSE_DISABLE != CY_CAPSENSE_LP_EN))
                if ((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E != context->ptrWdConfig[wdIndex].wdType)
            #endif /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP & CY_CAPSENSE_LP_EN */
                {
                    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) && (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MULTI_FREQUENCY_WIDGET_EN))
                        if (0u == ((&context->ptrWdConfig[wdIndex])->mfsConfig & CY_CAPSENSE_MFS_WIDGET_FREQ_ALL_CH_MASK))
                        {
                            /* Processes all widgets with disabled MFS and all widgets with the original (main) frequency */
                            result |= Cy_CapSense_ProcessWidget(wdIndex, context);
                        }
                    #else
                        result |= Cy_CapSense_ProcessWidget(wdIndex, context);
                    #endif
                }
        }
    }
    return result;
}


