zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_control.c
/*******************************************************************************
* Function Name: Cy_CapSense_ProcessWidget
****************************************************************************//**
*
* Performs full data processing of the specified widget if it is enabled.
*
* This function performs exactly the same tasks as
* Cy_CapSense_ProcessAllWidgets(), but only for a specified widget. This
* function can be used along with the Cy_CapSense_ScanWidget() function
* (4th Generation) to scan and process data for a specific widget or with
* the Cy_CapSense_ScanSlots() function (5th Generation).
* This function is called only after all the sensors in the widgets are scanned.
*
* The disabled and/or non-working widgets are not processed by this function.
*
* The pipeline scan method, which during scanning a current widget (N),
* performs the processing of the previously scanned widget (N-1)) can be
* implemented using this function and it may reduce the total execution time,
* increase the refresh rate, and decrease the average power consumption.
* See the function usage example below for details on usage.
*
* For the Fifth generation CAPSENSE&trade; if the specified widget has the enabled
* multi-frequency scan feature then the function does the following:
* - If the specified widget ID refers to main (base) frequency then the function
* processes raw count processing of all three widgets (main and two sub-widgets)
* and then status processing of the main widget only.
* - If the specified widget ID refers to sub-widgets (1st or 2nd frequency channels)
* then the function returns CY_CAPSENSE_STATUS_BAD_PARAM. To perform customized
* processing use the Cy_CapSense_ProcessWidgetExt() function.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \note For the fifth-generation low power CAPSENSE&trade; widgets
* of the \ref CY_CAPSENSE_WD_LOW_POWER_E type are not processed and
* \ref CY_CAPSENSE_STATUS_BAD_PARAM is returned
* if a widget of this type is passed.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the widget processing:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is successfully completed
* - CY_CAPSENSE_STATUS_BAD_PARAM     - The input parameter is invalid
* - CY_CAPSENSE_STATUS_INVALID_STATE - The specified widget is disabled
* - CY_CAPSENSE_STATUS_BAD_DATA      - The processing is failed
*
* \funcusage
*
* An example of pipeline implementation:
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_ProcessWidget
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ProcessWidget(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t result = CY_CAPSENSE_STATUS_SUCCESS;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;

    /* Check parameter validity */
    if (widgetId >= CY_CAPSENSE_TOTAL_WIDGET_COUNT)
    {
        result = CY_CAPSENSE_STATUS_BAD_PARAM;
    }
    else
    {
        ptrWdCfg = &context->ptrWdConfig[widgetId];
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        if ((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E == ptrWdCfg->wdType)
        {
            result = CY_CAPSENSE_STATUS_BAD_PARAM;
        }
        else
    #endif /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP */
        {
            /* Check widget enable status */
            if (0u == Cy_CapSense_IsWidgetEnabled(widgetId, context))
            {
                result = CY_CAPSENSE_STATUS_INVALID_STATE;
            }
            #if (((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) &&\
                 (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MULTI_FREQUENCY_WIDGET_EN))
                /* Check for sub-widget */
                if ((0u != (ptrWdCfg->mfsConfig & CY_CAPSENSE_MFS_EN_MASK)) &&
                    (0u != (ptrWdCfg->mfsConfig & CY_CAPSENSE_MFS_WIDGET_FREQ_ALL_CH_MASK)))
                {
                    result |= CY_CAPSENSE_STATUS_BAD_PARAM;
                }
            #endif
        }
    }

    if (CY_CAPSENSE_STATUS_SUCCESS == result)
    {
        #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
            #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MULTI_FREQUENCY_WIDGET_EN)
                if (0u != (ptrWdCfg->mfsConfig & CY_CAPSENSE_MFS_EN_MASK))
                {
                    Cy_CapSense_PreProcessWidget(widgetId + CY_CAPSENSE_MFS_CH2_INDEX, context);
                    Cy_CapSense_PreProcessWidget(widgetId + CY_CAPSENSE_MFS_CH1_INDEX, context);

                    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
                        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
                            if (((CY_CAPSENSE_MPSC_MIN_ORDER <= ptrWdCfg->mpOrder) ||
                                 (CY_CAPSENSE_MPSC_MIN_ORDER <= ptrWdCfg->mpOrderRows)) &&
                                 (CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod))
                            {
                                result |= Cy_CapSense_ProcessWidgetMpDeconvolution(widgetId + CY_CAPSENSE_MFS_CH2_INDEX, context);
                                result |= Cy_CapSense_ProcessWidgetMpDeconvolution(widgetId + CY_CAPSENSE_MFS_CH1_INDEX, context);
                            }
                        #endif
                    #endif

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_TX_ENABLED)
                        if ((CY_CAPSENSE_MPTX_MIN_ORDER <= ptrWdCfg->mpOrder) &&
                            (CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod))
                        {
                            result |= Cy_CapSense_ProcessWidgetMpDeconvolution(widgetId + CY_CAPSENSE_MFS_CH2_INDEX, context);
                            result |= Cy_CapSense_ProcessWidgetMpDeconvolution(widgetId + CY_CAPSENSE_MFS_CH1_INDEX, context);
                        }
                    #endif
                }
            #endif

            Cy_CapSense_PreProcessWidget(widgetId, context);
            #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_SELF_ENABLED)
                    if (((CY_CAPSENSE_MPSC_MIN_ORDER <= ptrWdCfg->mpOrder) ||
                         (CY_CAPSENSE_MPSC_MIN_ORDER <= ptrWdCfg->mpOrderRows)) &&
                         (CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod))
                    {
                        result |= Cy_CapSense_ProcessWidgetMpDeconvolution(widgetId, context);
                    }
                #endif
            #endif
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_PHASE_TX_ENABLED)
                if ((CY_CAPSENSE_MPTX_MIN_ORDER <= ptrWdCfg->mpOrder) &&
                    (CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod))
                {
                    result |= Cy_CapSense_ProcessWidgetMpDeconvolution(widgetId, context);
                }
            #endif
        #endif

