zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_control.c
        #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MULTI_FREQUENCY_WIDGET_EN)
            if (0u != (ptrWdCfg->mfsConfig & CY_CAPSENSE_MFS_EN_MASK))
            {
                result |= Cy_CapSense_DpProcessWidgetRawCounts(widgetId + CY_CAPSENSE_MFS_CH2_INDEX, context);
                result |= Cy_CapSense_DpProcessWidgetRawCounts(widgetId + CY_CAPSENSE_MFS_CH1_INDEX, context);
            }
        #endif
        result |= Cy_CapSense_DpProcessWidgetRawCounts(widgetId, context);

        switch (ptrWdCfg->senseMethod)
        {
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
                case CY_CAPSENSE_CSD_GROUP:
                    result |= Cy_CapSense_DpProcessCsdWidgetStatus(ptrWdCfg, context);
                    break;
            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                case CY_CAPSENSE_CSX_GROUP:
                    Cy_CapSense_DpProcessCsxWidgetStatus(ptrWdCfg);
                    break;
            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
                case CY_CAPSENSE_ISX_GROUP:
                    Cy_CapSense_DpProcessIsxWidgetStatus(ptrWdCfg);
                    break;
            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN) */

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
                case CY_CAPSENSE_WBX_GROUP:
                    Cy_CapSense_DpProcessWbxWidgetStatus(ptrWdCfg);
                    break;
            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN) */

            default:
                result |= CY_CAPSENSE_STATUS_BAD_PARAM;
                break;
        }
    }

    return result;
}


/*******************************************************************************
* Function Name: Cy_CapSense_ProcessWidgetExt
****************************************************************************//**
*
* Performs customized data processing on the selected widget.
*
* This function performs customized data processing specified by the mode
* parameter on a widget. This function can be used with any of the
* available scan functions. This function should be called only after all
* the sensors in the specified widget are scanned. Calling this function
* multiple times with the same mode without new sensor scan causes
* unexpected behavior. This function ignores the widget statuses like
* disabled and/or non-working and performs processing in any case.
*
* The CY_CAPSENSE_PROCESS_CALC_NOISE and CY_CAPSENSE_PROCESS_THRESHOLDS masks
* for mode parameter are supported only when smart sensing algorithm is enabled.
*
* The execution order of processing tasks starts from LSB to MSB of the
* mode parameter. To implement a different order of execution, call this
* function multiple times with the required mode parameter.
*
* For more details, refer to function usage example below.
*
* \note
* For the fifth-generation CAPSENSE&trade; and fifth-generation low power
* CAPSENSE&trade; extra processing should be performed prior a call of
* this function:
* * A raw count pre-processing calling either the Cy_CapSense_PreProcessWidget()
*   or Cy_CapSense_PreProcessSensor() functions.
* * A deconvolution for widgets with multi-phase Tx or Self calling the
*   Cy_CapSense_ProcessWidgetMpDeconvolution() function
*   (multi-phase Self is available only for the fifth-generation low power CAPSENSE&trade;)
* In this case a full processing flow consists of the following:
* * Cy_CapSense_PreProcessWidget()
* * Cy_CapSense_ProcessWidgetMpDeconvolution()
* * Cy_CapSense_ProcessWidgetExt()
*
* For liquid level widget this function updates only widget status, other is skipped.
*
* \note
* For the fifth generation and fifth-generation low power CAPSENSE&trade;
* if the specified widget has the enabled multi-frequency scan feature
* then the processing must follow the following order:
* * Sub-widget channel 2
* * Sub-widget channel 1
* * Main widget channel 0
* The CY_CAPSENSE_PROCESS_MFS_FILTER option is skipped for sub-widgets,
* however CY_CAPSENSE_PROCESS_STATUS option is available.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \note For the fifth-generation low power CAPSENSE&trade; widgets
* of the \ref CY_CAPSENSE_WD_LOW_POWER_E type are not processed and
* \ref CY_CAPSENSE_STATUS_BAD_PARAM is returned
* if a widget of this type is passed.
*
* \param mode
* Specifies the type of widget processing to be executed for the
* specified widget:
* 1. Bits [31..7] - Reserved.
* 2. Bits [6..0]  - CY_CAPSENSE_PROCESS_ALL - Execute all of the below tasks.
* 3. Bit [6]      - CY_CAPSENSE_PROCESS_STATUS - Update the status
*                   (on/off, centroid position).
* 4. Bit [5]      - CY_CAPSENSE_PROCESS_MFS_FILTER - Run the firmware filters
*                   for MFS on sensor rawcounts
*                   (applicable only for fifth-generation CAPSENSE&trade;
*                   and fifth-generation low power CAPSENSE&trade;).
* 5. Bit [4]      - CY_CAPSENSE_PROCESS_THRESHOLDS - Update the thresholds
*                   (only in full auto-tuning mode).
* 6. Bit [3]      - CY_CAPSENSE_PROCESS_CALC_NOISE - Calculate the noise
*                   (only in full auto-tuning mode).
* 7. Bit [2]      - CY_CAPSENSE_PROCESS_DIFFCOUNTS - Update the difference
*                   counts of each sensor.
* 8. Bit [1]      - CY_CAPSENSE_PROCESS_BASELINE - Update the baselines
*                   for all sensor.
* 9. Bit [0]      - CY_CAPSENSE_PROCESS_FILTER - Run the firmware filters
*                   on sensor rawcounts.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the widget processing operation:
* - CY_CAPSENSE_STATUS_SUCCESS      - The processing is successfully performed.
* - CY_CAPSENSE_STATUS_BAD_PARAM    - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_BAD_DATA     - The processing failed.
*
* \funcusage
*
* An example of customized data processing, changed processing order:
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_ProcessWidgetExt
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ProcessWidgetExt(
                uint32_t widgetId,
                uint32_t mode,
                cy_stc_capsense_context_t * context)
{
    uint32_t snsIndex;
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
    uint32_t snsHistorySize;
    uint32_t freqChIndex;
    uint16_t * ptrHistorySns;
    uint16_t * ptrBslnInvSns;
    uint8_t * ptrHistoryLowSns = NULL;
    cy_stc_capsense_sensor_context_t * ptrSnsCxtSns;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;

    /* Check parameter validity */
    if (widgetId < CY_CAPSENSE_TOTAL_WIDGET_COUNT)
    {
        ptrWdCfg = &context->ptrWdConfig[widgetId];

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        if ((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E != ptrWdCfg->wdType)
    #endif /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP */
        {
            capStatus = CY_CAPSENSE_STATUS_SUCCESS;
            snsHistorySize = ptrWdCfg->rawFilterConfig & CY_CAPSENSE_RC_FILTER_SNS_HISTORY_SIZE_MASK;

            /* Run the desired processing for the all CSD widget sensors */
            for (freqChIndex = 0u; freqChIndex < CY_CAPSENSE_CONFIGURED_FREQ_NUM; freqChIndex++)
            {
                ptrSnsCxtSns = &ptrWdCfg->ptrSnsContext[freqChIndex * context->ptrCommonConfig->numSns];
                ptrBslnInvSns = &ptrWdCfg->ptrBslnInv[freqChIndex * context->ptrCommonConfig->numSns];
                ptrHistorySns = &ptrWdCfg->ptrRawFilterHistory[freqChIndex * (CY_CAPSENSE_RAW_HISTORY_SIZE / CY_CAPSENSE_CONFIGURED_FREQ_NUM)];
                if (CY_CAPSENSE_IIR_FILTER_PERFORMANCE == (ptrWdCfg->rawFilterConfig & CY_CAPSENSE_RC_FILTER_IIR_MODE_MASK))
                {
                    ptrHistoryLowSns = &ptrWdCfg->ptrRawFilterHistoryLow[freqChIndex *
                            (CY_CAPSENSE_IIR_HISTORY_LOW_SIZE / CY_CAPSENSE_CONFIGURED_FREQ_NUM)];
                }

                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_REGULAR_RC_CMF_FILTER_EN)
                    if (0u != (mode & CY_CAPSENSE_PROCESS_FILTER))
                    {
                        if (0u != (ptrWdCfg->rawFilterConfig & CY_CAPSENSE_RC_FILTER_CM_EN_MASK))
                        {
                            /* Runs common mode filter */
                            Cy_CapSense_CommonModeFilter_Lib(ptrWdCfg->cmfThreshold, ptrWdCfg->numSns,
                                    (uint16_t *)ptrWdCfg->ptrSnsContext);
                        }
                    }
                #endif

                for (snsIndex = 0u; snsIndex < ptrWdCfg->numSns; snsIndex++)
                {
                     capStatus |= Cy_CapSense_DpProcessSensorRawCountsExt(ptrWdCfg, ptrSnsCxtSns, ptrHistorySns,
                                                                          ptrHistoryLowSns, mode, ptrBslnInvSns, context);

                    ptrSnsCxtSns++;
                    ptrBslnInvSns++;
                    ptrHistorySns += snsHistorySize;
                    if (NULL != ptrHistoryLowSns)
                    {
                        ptrHistoryLowSns++;
                    }
                }
            }

            #if ((CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) && \
                (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_FREQUENCY_SCAN_EN))
                /* Disable filtering for liquid level widgets */
                if (((uint8_t)CY_CAPSENSE_WD_LIQUID_LEVEL_E != ptrWdCfg->wdType) &&
                    ((uint8_t)CY_CAPSENSE_WD_LIQUID_PRESENCE_E != ptrWdCfg->wdType))
                {
                    ptrSnsCxtSns = ptrWdCfg->ptrSnsContext;
                    for (snsIndex = ptrWdCfg->numSns; snsIndex-- > 0u;)
                    {
                        Cy_CapSense_RunMfsFiltering(ptrSnsCxtSns, context);
                        ptrSnsCxtSns++;
                    }
                }
            #endif

