zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_control.c
            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_FREQUENCY_WIDGET_EN) && \
                 ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)))
                if ((0u != (ptrWdCfg->mfsConfig & CY_CAPSENSE_MFS_EN_MASK)) &&
                    (0u == (ptrWdCfg->mfsConfig & CY_CAPSENSE_MFS_WIDGET_FREQ_ALL_CH_MASK)) &&
                    ((uint8_t)CY_CAPSENSE_WD_LIQUID_LEVEL_E != ptrWdCfg->wdType) &&
                    ((uint8_t)CY_CAPSENSE_WD_LIQUID_PRESENCE_E != ptrWdCfg->wdType) &&
                    ((uint8_t)CY_CAPSENSE_WD_WHEATSTONE_BRIDGE_E != ptrWdCfg->wdType))
                {
                    if (0u != (mode & CY_CAPSENSE_PROCESS_MFS_FILTER))
                    {
                        (void)Cy_CapSense_RunMfsMedian(widgetId, context);
                    }
                }
            #endif

            if (0u != (mode & CY_CAPSENSE_PROCESS_STATUS))
            {
                switch (ptrWdCfg->senseMethod)
                {
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                        case CY_CAPSENSE_CSX_GROUP:
                            Cy_CapSense_DpProcessCsxWidgetStatus(ptrWdCfg);
                            break;
                    #endif

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
                        case CY_CAPSENSE_CSD_GROUP:
                            capStatus |= Cy_CapSense_DpProcessCsdWidgetStatus(ptrWdCfg, context);
                            break;
                    #endif

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_EN)
                        case CY_CAPSENSE_ISX_GROUP:
                            Cy_CapSense_DpProcessIsxWidgetStatus(ptrWdCfg);
                            break;
                    #endif

                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_EN)
                        case CY_CAPSENSE_WBX_GROUP:
                            Cy_CapSense_DpProcessWbxWidgetStatus(ptrWdCfg);
                            break;
                    #endif

                    default:
                        capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
                        /* No action */
                        break;
                }
            }
        }
    }
    return capStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_ProcessSensorExt
****************************************************************************//**
*
* Performs customized data processing on the selected sensor.
*
* This function performs customized data processing specified by the mode
* parameter on a sensor. This function performs the exact same task
* of the Cy_CapSense_ProcessWidgetExt() function but only on the specified
* sensor instead of all sensors in the widget.
*
* The pipeline scan method (i.e. during scanning of a sensor, processing
* of a previously scanned sensor is performed) can be implemented using this
* function and it may reduce the total scan/process time, increase the refresh
* rate, and decrease the power consumption. For more details, refer to
* function usage example below.
*
* \note
* For the fifth-generation CAPSENSE&trade; and fifth-generation low power
* CAPSENSE&trade; HW generation an extra processing should be  performed prior
* a call of this function:
* * A raw count pre-processing calling either the Cy_CapSense_PreProcessWidget()
*   or Cy_CapSense_PreProcessSensor() functions.
* * A deconvolution for widgets with multi-phase Tx or Self calling the
*   Cy_CapSense_ProcessWidgetMpDeconvolution() function
*   (multi-phase Self is available only for the fifth-generation low power CAPSENSE&trade;)
* In this case a full processing flow consists of the following:
* * Cy_CapSense_PreProcessWidget()
* * Cy_CapSense_ProcessWidgetMpDeconvolution()
* * Cy_CapSense_ProcessSensorExt() - each sensor
* * Cy_CapSense_ProcessWidgetExt()
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \note For the fifth-generation low power CAPSENSE&trade; widgets
* of the \ref CY_CAPSENSE_WD_LOW_POWER_E type are not processed and
* \ref CY_CAPSENSE_STATUS_BAD_PARAM is returned
* if a widget of this type is passed.
*
* \param sensorId
* Specifies the ID number of the sensor within the widget. A macro for the
* sensor ID within a specified widget can be found in the cycfg_capsense.h
* file defined as CY_CAPSENSE_<WIDGET_NAME>_SNS<SENSOR_NUMBER>_ID.
*
* \param mode
* Specifies the type of the sensor processing that must be executed for the
* specified sensor:
* 1. Bits [31..7] - Reserved.
* 2. Bits [6..0]  - CY_CAPSENSE_PROCESS_ALL - Execute all of the below tasks.
* 3. Bit [6]      - CY_CAPSENSE_PROCESS_STATUS - Update the status
*                   (on/off, centroid position) - not available for this function.
* 4. Bit [5]      - CY_CAPSENSE_PROCESS_MFS_FILTER - Run the firmware filters
*                   for MFS on sensor rawcounts - not available for this function.
*                   (applicable only for fifth-generation CAPSENSE&trade;
*                   and fifth-generation low power CAPSENSE&trade;).
* 5. Bit [4]      - CY_CAPSENSE_PROCESS_THRESHOLDS - Update the thresholds
*                   (only in full auto-tuning mode).
* 6. Bit [3]      - CY_CAPSENSE_PROCESS_CALC_NOISE - Calculate the noise
*                   (only in full auto-tuning mode).
* 7. Bit [2]      - CY_CAPSENSE_PROCESS_DIFFCOUNTS - Update the difference
*                   counts of each sensor.
* 8. Bit [1]      - CY_CAPSENSE_PROCESS_BASELINE - Update the baselines
*                   for all sensor.
* 9. Bit [0]      - CY_CAPSENSE_PROCESS_FILTER - Run the firmware filters
*                   on sensor rawcounts.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the sensor process operation:
* - CY_CAPSENSE_STATUS_SUCCESS      - The processing is successfully performed.
* - CY_CAPSENSE_STATUS_BAD_PARAM    - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_BAD_DATA     - The processing failed.
*
* \funcusage
*
* An example demonstrates pipeline implementation of sensor scanning and
* processing:
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_ProcessSensorExt
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ProcessSensorExt(
                uint32_t widgetId,
                uint32_t sensorId,
                uint32_t mode,
                const cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
    uint32_t freqChIndex;
    uint32_t snsHistorySize;
    uint16_t * ptrSnsBslnInv;
    uint16_t * ptrHistory;
    uint8_t  * ptrHistoryLow = NULL;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;

    if (widgetId < CY_CAPSENSE_TOTAL_WIDGET_COUNT)
    {
        ptrWdCfg = &context->ptrWdConfig[widgetId];

        if (sensorId < ptrWdCfg->numSns)
        {
        #if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
            if ((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E != ptrWdCfg->wdType)
        #endif /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP */
            {
                snsHistorySize = ptrWdCfg->rawFilterConfig & CY_CAPSENSE_RC_FILTER_SNS_HISTORY_SIZE_MASK;
                capStatus = CY_CAPSENSE_STATUS_SUCCESS;

                for (freqChIndex = 0u; freqChIndex < CY_CAPSENSE_CONFIGURED_FREQ_NUM; freqChIndex++)
                {
                    ptrSnsCxt = &ptrWdCfg->ptrSnsContext[sensorId + (freqChIndex * context->ptrCommonConfig->numSns)];
                    ptrSnsBslnInv = &ptrWdCfg->ptrBslnInv[sensorId + (freqChIndex * context->ptrCommonConfig->numSns)];
                    ptrHistory = &ptrWdCfg->ptrRawFilterHistory[(freqChIndex * (CY_CAPSENSE_RAW_HISTORY_SIZE / CY_CAPSENSE_CONFIGURED_FREQ_NUM)) +
                                                                (snsHistorySize * sensorId)];
                    if (CY_CAPSENSE_IIR_FILTER_PERFORMANCE == (ptrWdCfg->rawFilterConfig & CY_CAPSENSE_RC_FILTER_IIR_MODE_MASK))
                    {
                        ptrHistoryLow = &ptrWdCfg->ptrRawFilterHistoryLow[freqChIndex *
                                (CY_CAPSENSE_IIR_HISTORY_LOW_SIZE / CY_CAPSENSE_CONFIGURED_FREQ_NUM)];
                    }

                    capStatus |= Cy_CapSense_DpProcessSensorRawCountsExt(ptrWdCfg, ptrSnsCxt, ptrHistory,
                                                                         ptrHistoryLow, mode, ptrSnsBslnInv, context);
                }
                #if ((CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) && \
                    (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_FREQUENCY_SCAN_EN))
                    /* Disable filtering for liquid level and wheatstone bridge widgets */
                    if (((uint8_t)CY_CAPSENSE_WD_LIQUID_LEVEL_E != ptrWdCfg->wdType) &&
                        ((uint8_t)CY_CAPSENSE_WD_LIQUID_PRESENCE_E != ptrWdCfg->wdType) &&
                        ((uint8_t)CY_CAPSENSE_WD_WHEATSTONE_BRIDGE_E != ptrWdCfg->wdType))
                    {
                        ptrSnsCxt = ptrWdCfg->ptrSnsContext;
                        Cy_CapSense_RunMfsFiltering(ptrSnsCxt, context);
                    }
                #endif
            }
        }
    }
    return capStatus;
}


