zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_control.c
/*******************************************************************************
* Function Name: Cy_CapSense_Wakeup
****************************************************************************//**
*
* Resumes the middleware after System Deep Sleep.
*
* This function is used to resume the middleware operation after exiting
* System Deep Sleep. After the CAPSENSE&trade; HW block is powered on,
* an extra delay is required to establish the correct operation of
* the CAPSENSE&trade; HW block. No need for the Cy_CapSense_Wakeup() function
* call for the fifth-generation low power CAPSENSE&trade; because all needed
* delays are managed automatically in scan start functions.
*
* This function is called by the Cy_CapSense_DeepSleepCallback() function after
* exiting System Deep Sleep if the CAPSENSE&trade; Deep Sleep callback
* is registered.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure
* \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_Wakeup(const cy_stc_capsense_context_t * context)
{
    Cy_SysLib_DelayUs((uint16_t)context->ptrCommonConfig->analogWakeupDelay);
}


/*******************************************************************************
* Function Name: Cy_CapSense_DeepSleepCallback
****************************************************************************//**
*
* Handles CPU active to System Deep Sleep power mode transition
* for the CAPSENSE&trade; middleware.
*
* Calling this function directly from the application program
* is not recommended. Instead, Cy_SysPm_CpuEnterDeepSleep() should be
* used for the CPU active to System Deep Sleep power mode transition
* of the device.
* \note
* After the CPU Deep Sleep transition, the device automatically goes
* to System Deep Sleep if all conditions are fulfilled: another core is
* in CPU Deep Sleep, all the peripherals are ready to System Deep Sleep, etc.
* (see details in the device TRM).
*
* For proper operation of the CAPSENSE&trade; middleware during
* the CPU active to System Deep Sleep mode transition, a callback to
* this function should be registered using the Cy_SysPm_RegisterCallback()
* function with CY_SYSPM_DEEPSLEEP type. After the callback is registered,
* this function is called by the Cy_SysPm_CpuEnterDeepSleep() function to
* prepare the middleware to the device power mode transition.
*
* When this function is called with CY_SYSPM_CHECK_READY as an input, this
* function returns CY_SYSPM_SUCCESS if no scanning is in progress or not
* a single HW block is captured by the CAPSENSE&trade; middleware. Otherwise
* CY_SYSPM_FAIL is returned. If CY_SYSPM_FAIL status is returned, a device
* cannot change the power mode without completing the current scan as
* a transition to System Deep Sleep during the scan can disrupt the middleware
* operation.
*
* When this function is called with CY_SYSPM_AFTER_TRANSITION as an input,
* then the Cy_CapSense_Wakeup() function is called to resume the middleware
* operation after exiting System Deep Sleep. If there are no CAPSENSE&trade;
* captured HW blocks, no need for the Cy_CapSense_Wakeup() function call and
* restoring CAPSENSE&trade; immediately after Deep Sleep without
* the wake-up delay can lead to unpredictable behavior.
*
* For details of SysPm types and macros refer to the SysPm section of the
* PDL documentation.
*
* \note For the fifth-generation low power CAPSENSE&trade; this function does
* nothing. The device can easily go to and out of System Deep Sleep power mode.
* So there is no need to register it into the SysPm driver. Also the function
* should not be called from any interrupt handler for any device generation.
*
* \param callbackParams
* Refer to the description of the cy_stc_syspm_callback_params_t type in the
* Peripheral Driver Library documentation.
*
* \param mode
* Specifies mode cy_en_syspm_callback_mode_t.
*
* \return
* Returns the status cy_en_syspm_status_t of the operation requested
* by the mode parameter:
* - CY_SYSPM_SUCCESS  - System Deep Sleep power mode can be entered.
* - CY_SYSPM_FAIL     - System Deep Sleep power mode cannot be entered.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_CapSense_DeepSleepCallback(
                cy_stc_syspm_callback_params_t * callbackParams,
                cy_en_syspm_callback_mode_t mode)
{
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN || CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        const cy_stc_capsense_context_t * capsenseCxt = (cy_stc_capsense_context_t *)callbackParams->context;
    #else /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP */
        (void)callbackParams;
        (void)mode;
    #endif /* CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN || CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN */

    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        cy_en_csd_key_t mwKey;

        switch (mode)
        {
            case CY_SYSPM_CHECK_READY:
                mwKey = Cy_CSD_GetLockStatus(capsenseCxt->ptrCommonConfig->ptrCsdBase, capsenseCxt->ptrCommonConfig->ptrCsdContext);

                if (CY_CSD_CAPSENSE_KEY == mwKey)
                {
                    if (CY_CAPSENSE_NOT_BUSY != Cy_CapSense_IsBusy(capsenseCxt))
                    {
                        retVal = CY_SYSPM_FAIL;
                    }
                }
                break;

            case CY_SYSPM_AFTER_TRANSITION:
                mwKey = Cy_CSD_GetLockStatus(capsenseCxt->ptrCommonConfig->ptrCsdBase, capsenseCxt->ptrCommonConfig->ptrCsdContext);

                if (CY_CSD_CAPSENSE_KEY == mwKey)
                {
                    Cy_CapSense_Wakeup(capsenseCxt);
                }
                break;

            default:
                /* No action for other modes */
                break;
        }
    #elif (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        uint32_t curChIndex;
        const cy_stc_capsense_channel_config_t * ptrChCfg = &capsenseCxt->ptrCommonConfig->ptrChConfig[0u];

        switch (mode)
        {
            case CY_SYSPM_CHECK_READY:
                if (CY_CAPSENSE_NOT_BUSY != Cy_CapSense_IsBusy(capsenseCxt))
                {
                    retVal = CY_SYSPM_FAIL;
                }
                break;

            case CY_SYSPM_AFTER_TRANSITION:
                for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                {
                    if (CY_MSC_CAPSENSE_KEY == Cy_MSC_GetLockStatus(ptrChCfg->ptrHwBase,
                                                                    ptrChCfg->ptrHwContext))
                    {
                        Cy_CapSense_Wakeup(capsenseCxt);
                        break;
                    }
                    ptrChCfg++;
                }
                break;

            default:
                /* No action for other modes */
                break;
        }
    #endif

    return retVal;
}

#if ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_GESTURE_EN) || \
     (CY_CAPSENSE_DISABLE != CY_CAPSENSE_BALLISTIC_MULTIPLIER_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_IncrementGestureTimestamp
****************************************************************************//**
*
* Increments the timestamp register for the predefined timestamp interval.
*
* A timestamp is required for the operation of the Gesture and Ballistic multiplier
* feature. Hence, this function and timestamp are required only if the Gesture
* detection or Ballistic multiplier feature is enabled.
*
* This function increments the timestamp by the interval specified
* in the context->ptrCommonContext->timestampInterval register. The unit for
* the timestamp and timestamp interval is milliseconds and the default value of the
* interval is 1.
*
* The application program must periodically call this
* function or register a periodic callback to this function to keep the
* timestamp updated and operational for the operation of the Gesture and
* Ballistic multiplier feature.
*
* The timestamp can be updated in one of the three methods:
* 1. Register a periodic callback for the
*    Cy_CapSense_IncrementGestureTimestamp() function.
* 2. Periodically call the Cy_CapSense_IncrementGestureTimestamp() function
*    from the application program.
* 3. Directly modify the timestamp using the
*    Cy_CapSense_SetGestureTimestamp() function.
*
* See the function usage example below for more details.
*
* The interval at which this function is called should match with interval
* defined in context->ptrCommonContext->timestampInterval register. Either the
* register value can be updated to match the callback interval or the callback
* can be made to be set in the register at an interval.
*
* If a timestamp is available from another source, the application program
* may choose to periodically update the timestamp by using the
* Cy_CapSense_SetGestureTimestamp() function instead of
* registering a callback.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \funcusage
*
* An example of timestamp updating:
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_Timestamp
*
*******************************************************************************/
void Cy_CapSense_IncrementGestureTimestamp(cy_stc_capsense_context_t * context)
{
    context->ptrCommonContext->timestamp +=
                context->ptrCommonContext->timestampInterval;
}


