zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_control.c
/*******************************************************************************
* Function Name: Cy_CapSense_SetGestureTimestamp
****************************************************************************//**
*
* Rewrites the timestamp register by the specified value.
*
* This function writes the specified value into the middleware timestamp
* context->ptrCommonContext->timestamp register.
*
* If a timestamp is available from another source, the application program
* may choose to periodically update the timestamp by using this function
* instead of registering a callback.
*
* Do not modify the timestamp arbitrarily or simultaneously use with
* the Cy_CapSense_IncrementGestureTimestamp() function, which may result in
* unexpected result.
*
* \param value
* Specifies the timestamp value (in ms).
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetGestureTimestamp(
                uint32_t value,
                cy_stc_capsense_context_t * context)
{
    context->ptrCommonContext->timestamp = value;
}
#endif /* ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_GESTURE_EN) || \
           (CY_CAPSENSE_DISABLE != CY_CAPSENSE_BALLISTIC_MULTIPLIER_EN)) */

/*******************************************************************************
* Function Name: Cy_CapSense_Restore
****************************************************************************//**
*
* Resumes the middleware operation if the Cy_CapSense_Save() function was
* called previously.
*
* This function, along with the Cy_CapSense_Save() function is specifically
* designed for ease of use and supports time multiplexing of the CAPSENSE&trade; HW
* block among multiple middleware. When the CAPSENSE&trade; HW blocks are shared by
* multiple middleware, this function can be used to restore the previous state of
* the CAPSENSE&trade; HW block(s) and CAPSENSE&trade; Middleware is saved using the
* Cy_CapSense_Save() function. See the function usage example below for
* details on usage.
*
* This function performs the same tasks as Cy_CapSense_Init() function and is
* kept for API consistency among middlewares. It is recommended to use
* Cy_CapSense_Save() and Cy_CapSense_Restore() functions to implement
* time-multiplexed mode instead of Cy_CapSense_DeInit() and Cy_CapSense_Init()
* functions for further compatibility.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the resume process. If CY_CAPSENSE_STATUS_SUCCESS is not
* received, the resume process fails and retries may be required.
*
* \funcusage
*
* An example of sharing the CAPSENSE&trade; HW block by CAPSENSE&trade; and CSDADC middleware:
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_TimeMultiplex
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_Restore(cy_stc_capsense_context_t * context)
{
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        return Cy_CapSense_Restore_V2(context);
    #elif (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        return Cy_CapSense_Restore_V3(context);
    #elif (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        return Cy_CapSense_Restore_V3Lp(context);
    #elif
        #error Unsupported platform
    #endif
}

#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
/*******************************************************************************
* Function Name: Cy_CapSense_Restore_V2
****************************************************************************//**
*
* Resumes the middleware operation if the Cy_CapSense_Save() function was
* called previously.
*
* This function, along with the Cy_CapSense_Save() function is specifically
* designed for ease of use and supports time multiplexing of the CAPSENSE&trade; HW
* block among multiple middleware. When the CAPSENSE&trade; HW blocks are shared by
* multiple middleware, this function can be used to restore the previous state of
* the CAPSENSE&trade; HW block(s) and CAPSENSE&trade; Middleware is saved using the
* Cy_CapSense_Save() function. See the function usage example below for
* details on usage.
*
* This function performs the same tasks as Cy_CapSense_Init() function and is
* kept for API consistency among middlewares. It is recommended to use
* Cy_CapSense_Save() and Cy_CapSense_Restore() functions to implement
* time-multiplexed mode instead of Cy_CapSense_DeInit() and Cy_CapSense_Init()
* functions for further compatibility.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the resume process. If CY_CAPSENSE_STATUS_SUCCESS is not
* received, the resume process fails and retries may be required.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_Restore_V2(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_INVALID_STATE;
    cy_en_csd_key_t mvKey;
    cy_en_csd_status_t csdHwStatus;
    cy_stc_csd_context_t * ptrCsdCxt = context->ptrCommonConfig->ptrCsdContext;
    CSD_Type * ptrCsdBaseAdd = context->ptrCommonConfig->ptrCsdBase;
    uint32_t watchdogCounter;

    /* Number of cycle of one for () loop */
    const uint32_t cyclesPerLoop = 5u;
    /* Timeout in microseconds */
    const uint32_t watchdogTimeoutUs = 10000u;

    /* Get the CSD HW block status */
    mvKey = Cy_CSD_GetLockStatus(ptrCsdBaseAdd, ptrCsdCxt);
    if (CY_CSD_NONE_KEY == mvKey)
    {
        /* Reset CSD HW block sequencer state always to handle a corner case when the sequencer is not in the idle state */
        context->ptrCommonConfig->ptrCsdBase->INTR_MASK = CY_CAPSENSE_CSD_INTR_MASK_CLEAR_MSK;
        (void)context->ptrCommonConfig->ptrCsdBase->INTR_MASK;
        context->ptrCommonConfig->ptrCsdBase->SEQ_START = CY_CAPSENSE_CSD_SEQ_START_ABORT_MSK;
        watchdogCounter = Cy_CapSense_WatchdogCyclesNum(watchdogTimeoutUs,
            context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA, cyclesPerLoop);
        do
        {
            csdHwStatus = Cy_CSD_GetConversionStatus(ptrCsdBaseAdd, ptrCsdCxt);
            watchdogCounter--;
        }
        while((CY_CSD_BUSY == csdHwStatus) && (0u != watchdogCounter));

