zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_control.c
        if (CY_CSD_SUCCESS == csdHwStatus)
        {
            #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_USE_CAPTURE)
                csdHwStatus = Cy_CSD_Capture(ptrCsdBaseAdd, CY_CSD_CAPSENSE_KEY, ptrCsdCxt);
            #else
                csdHwStatus = Cy_CSD_Init(ptrCsdBaseAdd, &cy_capsense_csdCfg, CY_CSD_CAPSENSE_KEY, ptrCsdCxt);

                /* The time interval is required for settling analog part of the HW block. */
                Cy_SysLib_DelayUs(CY_CAPSENSE_ANALOG_SETTLING_TIME_US);
            #endif

            if (CY_CSD_SUCCESS == csdHwStatus)
            {
                capStatus = CY_CAPSENSE_STATUS_SUCCESS;
            }
        }
    }
    return capStatus;
}
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */


#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
/*******************************************************************************
* Function Name: Cy_CapSense_Restore_V3
****************************************************************************//**
*
* Resumes the middleware operation if the Cy_CapSense_Save() function was
* called previously.
*
* This function, along with the Cy_CapSense_Save() function is specifically
* designed for ease of use and supports time multiplexing of the CAPSENSE&trade; HW
* block among multiple middleware. When the CAPSENSE&trade; HW blocks are shared by
* multiple middleware, this function can be used to restore the previous state of
* the CAPSENSE&trade; HW block(s) and CAPSENSE&trade; Middleware is saved using the
* Cy_CapSense_Save() function. See the function usage example below for
* details on usage.
*
* This function performs the same tasks as Cy_CapSense_Init() function and is
* kept for API consistency among middlewares. It is recommended to use
* Cy_CapSense_Save() and Cy_CapSense_Restore() functions to implement
* time-multiplexed mode instead of Cy_CapSense_DeInit() and Cy_CapSense_Init()
* functions for further compatibility.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the resume process. If CY_CAPSENSE_STATUS_SUCCESS is not
* received, the resume process fails and retries may be required.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_Restore_V3(cy_stc_capsense_context_t * context)
{
    uint32_t curChIndex;
    cy_en_msc_status_t mscHwStatus;
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;
    const cy_stc_capsense_channel_config_t * ptrChConfig = &context->ptrCommonConfig->ptrChConfig[0u];

    for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
    {
        /* Get MSC HW blocks statuses */
        if (CY_MSC_NONE_KEY != Cy_MSC_GetLockStatus(ptrChConfig->ptrHwBase, ptrChConfig->ptrHwContext))

        {
            capStatus = CY_CAPSENSE_STATUS_HW_LOCKED;
            break;
        }
        ptrChConfig++;
    }

    if (capStatus == CY_CAPSENSE_STATUS_SUCCESS)
    {
        capStatus = Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_CAPTURED_DEFAULT, context);
        if (capStatus == CY_CAPSENSE_STATUS_SUCCESS)
        {
            ptrChConfig = &context->ptrCommonConfig->ptrChConfig[0u];
            /* Capture MSC HW blocks */
            for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
            {
                #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_USE_CAPTURE)
                    mscHwStatus = Cy_MSC_Capture(ptrChConfig->ptrHwBase,
                                            CY_MSC_CAPSENSE_KEY, ptrChConfig->ptrHwContext);
                #else
                    mscHwStatus = Cy_MSC_Init(ptrChConfig->ptrHwBase, &cy_capsense_mscCfg,
                                              CY_MSC_CAPSENSE_KEY, ptrChConfig->ptrHwContext);
                #endif

                if (CY_MSC_SUCCESS != mscHwStatus)
                {
                    capStatus = CY_CAPSENSE_STATUS_INVALID_STATE;
                    break;
                }
                ptrChConfig++;
            }
        }
    }
    return capStatus;
}
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */


#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
/*******************************************************************************
* Function Name: Cy_CapSense_Restore_V3Lp
****************************************************************************//**
*
* Resumes the middleware operation if the Cy_CapSense_Save() function was
* called previously.
*
* This function, along with the Cy_CapSense_Save() function is specifically
* designed for ease of use and supports time multiplexing of the CAPSENSE&trade; HW
* block among multiple middleware. When the CAPSENSE&trade; HW blocks are shared by
* multiple middleware, this function can be used to restore the previous state of
* the CAPSENSE&trade; HW block(s) and CAPSENSE&trade; Middleware is saved using the
* Cy_CapSense_Save() function. See the function usage example below for
* details on usage.
*
* This function performs the same tasks as Cy_CapSense_Init() function and is
* kept for API consistency among middlewares. It is recommended to use
* Cy_CapSense_Save() and Cy_CapSense_Restore() functions to implement
* time-multiplexed mode instead of Cy_CapSense_DeInit() and Cy_CapSense_Init()
* functions for further compatibility.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the resume process. If CY_CAPSENSE_STATUS_SUCCESS is not
* received, the resume process fails and retries may be required.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_Restore_V3Lp(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_HW_LOCKED;
    cy_en_msclp_status_t msclpHwStatus;
    const cy_stc_capsense_channel_config_t * ptrChConfig = context->ptrCommonConfig->ptrChConfig;

    if (CY_MSCLP_NONE_KEY == Cy_MSCLP_GetLockStatus(ptrChConfig->ptrHwBase, ptrChConfig->ptrHwContext))
    {
        #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_USE_CAPTURE)
            msclpHwStatus = Cy_MSCLP_Capture(ptrChConfig->ptrHwBase,
                            CY_MSCLP_CAPSENSE_KEY, ptrChConfig->ptrHwContext);
        #else
            msclpHwStatus = Cy_MSCLP_Init(ptrChConfig->ptrHwBase, &cy_capsense_msclpCfg,
                            CY_MSCLP_CAPSENSE_KEY, ptrChConfig->ptrHwContext);
        #endif

        if (CY_MSCLP_SUCCESS != msclpHwStatus)
        {
            capStatus = CY_CAPSENSE_STATUS_INVALID_STATE;
        }
        else
        {
            capStatus = Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_CAPTURED_DEFAULT, context);
        }
    }

