zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_control.c
    return capStatus;
}
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */

/*******************************************************************************
* Function Name: Cy_CapSense_Save
****************************************************************************//**
*
* Saves the state of CAPSENSE&trade; so the functionality can be restored
* using the Cy_CapSense_Restore() function.
*
* This function, along with the Cy_CapSense_Restore() function, is specifically
* designed for ease of use and supports time multiplexing of the CAPSENSE&trade; HW
* block among multiple middleware. When the CAPSENSE&trade; HW block is shared by
* multiple middleware, this function can be used to save the current state of
* the CAPSENSE&trade; HW block and CAPSENSE&trade; Middleware prior to releasing the
* CAPSENSE&trade; HW block for use by other middleware. See the function usage example
* below for details on usage.
*
* This function performs the same tasks as the Cy_CapSense_DeInit() function and is
* kept for API consistency among middlewares. It is recommended to use
* Cy_CapSense_Save() and Cy_CapSense_Restore() functions to implement
* Time-multiplexed mode instead of Cy_CapSense_DeInit() and Cy_CapSense_Init()
* functions for further compatibility.
*
* This function performs the following operations:
* * Releases the CAPSENSE&trade; HW block.
* * Configures sensor pins to the default state and disconnects them from
*   analog buses.
* * Disconnects external capacitors from analog buses.
* * Sets the middleware state to default.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the process. If CY_CAPSENSE_STATUS_SUCCESS is not received,
* the save process fails and retries may be required.
*
* \funcusage
*
* An example of sharing the CAPSENSE&trade; HW block by the CAPSENSE&trade; and CSDADC middleware.<br>
* Declares the CapSense_ISR_cfg variable:
* \snippet capsense/snippet/main.c snippet_m4_capsense_interrupt_source_declaration
*
* Declares the CSDADC_ISR_cfg variable:
* \snippet capsense/snippet/main.c snippet_m4_adc_interrupt_source_declaration
*
* Defines the CapSense interrupt handler:
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_IntHandler
*
* Defines the CSDADC interrupt handler:
* \snippet capsense/snippet/main.c snippet_CSDADC_Interrupt
*
* The part of the main.c FW flow:
* \snippet capsense/snippet/main.c snippet_Cy_CapSense_TimeMultiplex
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_Save(cy_stc_capsense_context_t * context)
{
    #if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
        return Cy_CapSense_Save_V2(context);
    #elif (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
        return Cy_CapSense_Save_V3(context);
    #elif (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
        return Cy_CapSense_Save_V3Lp(context);
    #elif
        #error Unsupported platform
    #endif
}

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
/*******************************************************************************
* Function Name: Cy_CapSense_Save_V3Lp
****************************************************************************//**
*
* Saves the state of CAPSENSE&trade; so the functionality can be restored
* using the Cy_CapSense_Restore() function.
*
* This function, along with the Cy_CapSense_Restore() function, is specifically
* designed for ease of use and supports time multiplexing of the CAPSENSE&trade; HW
* block among multiple middleware. When the CAPSENSE&trade; HW block is shared by
* multiple middleware, this function can be used to save the current state of
* the CAPSENSE&trade; HW block and CAPSENSE&trade; Middleware prior to releasing the
* CAPSENSE&trade; HW block for use by other middleware. See the function usage example
* below for details on usage.
*
* This function performs the same tasks as the Cy_CapSense_DeInit() function and is
* kept for API consistency among middlewares. It is recommended to use
* Cy_CapSense_Save() and Cy_CapSense_Restore() functions to implement
* Time-multiplexed mode instead of Cy_CapSense_DeInit() and Cy_CapSense_Init()
* functions for further compatibility.
*
* This function performs the following operations:
* * Releases the CAPSENSE&trade; HW block.
* * Configures sensor pins to the default state and disconnects them from
*   analog buses.
* * Disconnects external capacitors from analog buses.
* * Sets the middleware state to default.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return status
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_Save_V3Lp(cy_stc_capsense_context_t * context)
{
    cy_en_msclp_status_t initStatus;
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_INVALID_STATE;
    const cy_stc_capsense_channel_config_t * ptrChannel = context->ptrCommonConfig->ptrChConfig;

    if (CY_CAPSENSE_NOT_BUSY == Cy_CapSense_IsBusy(context))
    {
        if (CY_MSCLP_CAPSENSE_KEY == Cy_MSCLP_GetLockStatus(ptrChannel->ptrHwBase, ptrChannel->ptrHwContext))
        {
            /* Disconnect external capacitors and sensor pins from analog bus */
            (void)Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_UNDEFINED, context);
            initStatus = Cy_MSCLP_DeInit(ptrChannel->ptrHwBase, CY_MSCLP_CAPSENSE_KEY, ptrChannel->ptrHwContext);
            if (CY_MSCLP_SUCCESS == initStatus)
            {
                capStatus = CY_CAPSENSE_STATUS_SUCCESS;
            }
        }
        else
        {
            capStatus = CY_CAPSENSE_STATUS_HW_LOCKED;
        }
    }
    else
    {
        capStatus = CY_CAPSENSE_STATUS_HW_BUSY;
    }

    return capStatus;
}
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) */


#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
/*******************************************************************************
* Function Name: Cy_CapSense_Save_V3
****************************************************************************//**
*
* Saves the state of CAPSENSE&trade; so the functionality can be restored
* using the Cy_CapSense_Restore() function.
*
* This function, along with the Cy_CapSense_Restore() function, is specifically
* designed for ease of use and supports time multiplexing of the CAPSENSE&trade; HW
* block among multiple middleware. When the CAPSENSE&trade; HW block is shared by
* multiple middleware, this function can be used to save the current state of
* the CAPSENSE&trade; HW block and CAPSENSE&trade; Middleware prior to releasing the
* CAPSENSE&trade; HW block for use by other middleware. See the function usage example
* below for details on usage.
*
* This function performs the same tasks as the Cy_CapSense_DeInit() function and is
* kept for API consistency among middlewares. It is recommended to use
* Cy_CapSense_Save() and Cy_CapSense_Restore() functions to implement
* Time-multiplexed mode instead of Cy_CapSense_DeInit() and Cy_CapSense_Init()
* functions for further compatibility.
*
* This function performs the following operations:
* * Releases the CAPSENSE&trade; HW block.
* * Configures sensor pins to the default state and disconnects them from
*   analog buses.
* * Disconnects external capacitors from analog buses.
* * Sets the middleware state to default.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return status
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_Save_V3(cy_stc_capsense_context_t * context)
{
    uint32_t curChIndex;
    cy_en_msc_status_t initStatus;
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;
    const cy_stc_capsense_channel_config_t * ptrChannel = context->ptrCommonConfig->ptrChConfig;


