zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_control.c
    if (CY_CAPSENSE_NOT_BUSY == Cy_CapSense_IsBusy(context))
    {
        for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
        {
            /* Get MSC HW blocks statuses */
            if (CY_MSC_CAPSENSE_KEY != Cy_MSC_GetLockStatus(ptrChannel[curChIndex].ptrHwBase, ptrChannel[curChIndex].ptrHwContext))
            {
                capStatus = CY_CAPSENSE_STATUS_HW_LOCKED;
                break;
            }
        }
        if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
        {
            capStatus = Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_UNDEFINED, context);
            if (capStatus == CY_CAPSENSE_STATUS_SUCCESS)
            {
                for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                {
                    initStatus = Cy_MSC_DeInit(ptrChannel[curChIndex].ptrHwBase, CY_MSC_CAPSENSE_KEY, ptrChannel[curChIndex].ptrHwContext);
                    if (CY_MSC_SUCCESS != initStatus)
                    {
                        capStatus = CY_CAPSENSE_STATUS_HW_LOCKED;
                        break;
                    }
                }
            }
        }
    }
    else
    {
        capStatus = CY_CAPSENSE_STATUS_HW_BUSY;
    }
    return capStatus;
}
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */


#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
/*******************************************************************************
* Function Name: Cy_CapSense_Save_V2
****************************************************************************//**
*
* Saves the state of CAPSENSE&trade; so the functionality can be restored
* using the Cy_CapSense_Restore() function.
*
* This function, along with the Cy_CapSense_Restore() function, is specifically
* designed for ease of use and supports time multiplexing of the CAPSENSE&trade; HW
* block among multiple middleware. When the CAPSENSE&trade; HW block is shared by
* multiple middleware, this function can be used to save the current state of
* the CAPSENSE&trade; HW block and CAPSENSE&trade; Middleware prior to releasing the
* CAPSENSE&trade; HW block for use by other middleware. See the function usage example
* below for details on usage.
*
* This function performs the same tasks as the Cy_CapSense_DeInit() function and is
* kept for API consistency among middlewares. It is recommended to use
* Cy_CapSense_Save() and Cy_CapSense_Restore() functions to implement
* Time-multiplexed mode instead of Cy_CapSense_DeInit() and Cy_CapSense_Init()
* functions for further compatibility.
*
* This function performs the following operations:
* * Releases the CAPSENSE&trade; HW block.
* * Configures sensor pins to the default state and disconnects them from
*   analog buses.
* * Disconnects external capacitors from analog buses.
* * Sets the middleware state to default.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return status
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_Save_V2(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_INVALID_STATE;
    cy_en_csd_status_t initStatus;

    if (CY_CAPSENSE_NOT_BUSY == Cy_CapSense_IsBusy(context))
    {
        /* Disconnect external capacitors and sensor pins from analog bus */
        (void)Cy_CapSense_SwitchSensingMode(CY_CAPSENSE_UNDEFINED_GROUP, context);
        /* Release the CSD HW block */
        initStatus = Cy_CSD_DeInit(
                        context->ptrCommonConfig->ptrCsdBase,
                        CY_CSD_CAPSENSE_KEY,
                        context->ptrCommonConfig->ptrCsdContext);
        if (CY_CSD_SUCCESS == initStatus)

        {
            capStatus = CY_CAPSENSE_STATUS_SUCCESS;
        }
    }
    return capStatus;
}
#endif /* (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN) */

/*******************************************************************************
* Function Name: Cy_CapSense_RegisterCallback
****************************************************************************//**
*
* Registers a ures's callback function.
*
* The registered function will be called by the CAPSENSE&trade; middleware when
* the specified event \ref cy_en_capsense_callback_event_t has occurred in
* the CAPSENSE&trade; middleware.
*
* \param callbackType
* The event on which the registered user's function is called by the CAPSENSE&trade;
* middleware. Refer to \ref cy_en_capsense_callback_event_t for the list of
* supported events.
*
* \param callbackFunction
* The pointer to the user's callback function to be called by the middleware.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the callback registration:
* - CY_CAPSENSE_STATUS_SUCCESS      - The action performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM    - The input parameter is invalid.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_RegisterCallback(
                cy_en_capsense_callback_event_t callbackType,
                cy_capsense_callback_t callbackFunction,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t retVal = CY_CAPSENSE_STATUS_SUCCESS;

    if ((NULL != callbackFunction) && (NULL != context))
    {

        switch (callbackType)
        {
            case CY_CAPSENSE_START_SAMPLE_E:
                context->ptrInternalContext->ptrSSCallback = callbackFunction;
                break;
            case CY_CAPSENSE_END_OF_SCAN_E:
                context->ptrInternalContext->ptrEOSCallback = callbackFunction;
                break;
            default:
                retVal = CY_CAPSENSE_STATUS_BAD_PARAM;
                break;
        }
    }
    else
    {
        retVal = CY_CAPSENSE_STATUS_BAD_PARAM;
    }

    return retVal;
}


