zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_control.c
/*******************************************************************************
* Function Name: Cy_CapSense_UnRegisterCallback
****************************************************************************//**
*
* This function unregisters a previously registered user's callback function
* in the CAPSENSE&trade; middleware.
*
* \param callbackType
* The event on which the callback function should be unregistered.
* Refer to \ref cy_en_capsense_callback_event_t for the list of
* supported events.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the callback deregistration:
* - CY_CAPSENSE_STATUS_SUCCESS      - The action performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM    - The input parameter is invalid.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_UnRegisterCallback(
                cy_en_capsense_callback_event_t callbackType,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t retVal = CY_CAPSENSE_STATUS_SUCCESS;

    if (NULL != context)
    {
        switch (callbackType)
        {
            case CY_CAPSENSE_START_SAMPLE_E:
                context->ptrInternalContext->ptrSSCallback = NULL;
                break;
            case CY_CAPSENSE_END_OF_SCAN_E:
                context->ptrInternalContext->ptrEOSCallback = NULL;
                break;
            default:
                retVal = CY_CAPSENSE_STATUS_BAD_PARAM;
                break;
        }
    }
    else
    {
        retVal = CY_CAPSENSE_STATUS_BAD_PARAM;
    }

    return retVal;

}

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
/*******************************************************************************
* Function Name: Cy_CapSense_ReadWidgetCdacParam
****************************************************************************//**
*
* Reads the CDAC parameters of the widget and writes them into the buffer.
*
* Reads CDAC parameters from CAPSENSE&trade; Data Structure and writes received 
* values into the provided buffer. 
* This function must be called after Cy_CapSense_Enable(). 
* In case of run-time usage make sure you have updated all statuses, baselines, 
* history of filtering, etc.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
*
* \param ptrBuffer
* Buffer to store the CDAC parameters.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \funcusage
*
* The function is used for one-time calibration. Full example:
*
* -# Add EEPROM configuration:
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_ConfigEmulatedEEPROM
*
* -# Add EEPROM initialization:
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_InitEmulatedEEPROM
*
* -# Liquid level one-time calibration:
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_LiquidLevelOneTimeCalibration
*
* -# Add API to get buffer posiiton in EEPROM:
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_GetBufferPositionEEPROM
*
*******************************************************************************/
void Cy_CapSense_ReadWidgetCdacParam(
                uint8_t * ptrBuffer,
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    uint32_t i;

    /* Copy CDAC codes from CAPSENSE&trade; to user's buffer */
    ptrBuffer[CY_CAPSENSE_CDAC_CREF_OFFSET] = context->ptrWdContext[widgetId].cdacRef;
    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) && \
        ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_FINE_EN) || \
            (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_FINE_EN) || \
            (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CDAC_FINE_EN) || \
            (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CDAC_FINE_EN)))
        ptrBuffer[CY_CAPSENSE_CDAC_CFINE_OFFSET] = context->ptrWdContext[widgetId].cdacFine;
    #endif
    ptrBuffer[CY_CAPSENSE_CDAC_CCOMP_DIV_OFFSET] = (uint8_t)(context->ptrWdContext[widgetId].cdacCompDivider & 0xFFu);
    ptrBuffer[CY_CAPSENSE_CDAC_CCOMP_DIV_OFFSET + 1u] = (uint8_t)((context->ptrWdContext[widgetId].cdacCompDivider >> 8u) & 0xFFu);
    for (i = 0u; i < context->ptrWdConfig[widgetId].numSns; i++)
    {
        ptrBuffer[CY_CAPSENSE_CDAC_CCOMP_OFFSET + i] = context->ptrWdConfig[widgetId].ptrSnsContext[i].cdacComp;
    }
}

/*******************************************************************************
* Function Name: Cy_CapSense_WriteWidgetCdacParam
****************************************************************************//**
*
* Parse buffer as CDAC parameters and writes them into a CAPSENSE&trade; Data Structure.
*
* Reads a provided buffer content and writes received values into CAPSENSE&trade; Data Structure. 
* This function must be called before Cy_CapSense_Enable() and after Cy_CapSense_Init(). 
* In case of run-time usage make sure you have updated all statuses, baselines, 
* history of filtering, etc.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
*
* \param ptrBuffer
* Buffer to store the CDAC parameters.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \funcusage
*
* The function is used for one-time calibration. Full example:
*
* -# Add EEPROM configuration:
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_ConfigEmulatedEEPROM
*
* -# Add EEPROM initialization:
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_InitEmulatedEEPROM
*
* -# Liquid level one-time calibration:
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_LiquidLevelOneTimeCalibration
*
* -# Add API to get buffer posiiton in EEPROM:
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_GetBufferPositionEEPROM
*
*******************************************************************************/
void Cy_CapSense_WriteWidgetCdacParam(
                uint8_t * ptrBuffer,
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    uint32_t i;

