zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_control.c
    /* Copy CDAC codes from user's buffer into CapSense Data Structure */
    context->ptrWdContext[widgetId].cdacRef = ptrBuffer[CY_CAPSENSE_CDAC_CREF_OFFSET];
    #if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP) && \
        ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_FINE_EN) || \
            (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_FINE_EN) || \
            (CY_CAPSENSE_ENABLE == CY_CAPSENSE_ISX_CDAC_FINE_EN) || \
            (CY_CAPSENSE_ENABLE == CY_CAPSENSE_WBX_CDAC_FINE_EN)))
        context->ptrWdContext[widgetId].cdacFine = ptrBuffer[CY_CAPSENSE_CDAC_CFINE_OFFSET];
    #endif
    context->ptrWdContext[widgetId].cdacCompDivider = 
        (uint16_t)ptrBuffer[CY_CAPSENSE_CDAC_CCOMP_DIV_OFFSET] + (uint16_t)((uint16_t)ptrBuffer[CY_CAPSENSE_CDAC_CCOMP_DIV_OFFSET + 1u] << 8u);
    for (i = 0u; i < context->ptrWdConfig[widgetId].numSns; i++)
    {
        context->ptrWdConfig[widgetId].ptrSnsContext[i].cdacComp = ptrBuffer[CY_CAPSENSE_CDAC_CCOMP_OFFSET + i];
    }
}

/*******************************************************************************
* Function Name: Cy_CapSense_SetWidgetCalibrationState
****************************************************************************//**
*
* Sets widget calibration state.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param state
* The calibration state to set for the widget.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \funcusage
*
* The function is used for one-time calibration. Full example:
*
* -# Add EEPROM configuration:
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_ConfigEmulatedEEPROM
*
* -# Add EEPROM initialization:
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_InitEmulatedEEPROM
*
* -# Liquid level one-time calibration:
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_LiquidLevelOneTimeCalibration
*
* -# Add API to get buffer posiiton in EEPROM:
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_GetBufferPositionEEPROM
*
*******************************************************************************/
void Cy_CapSense_SetWidgetCalibrationState(
                uint32_t widgetId, 
                uint32_t state,
                cy_stc_capsense_context_t * context)
{

    if (0u == state)
    {
        context->ptrWdContext[widgetId].status &= (uint32_t)(~(uint32_t)CY_CAPSENSE_WD_FACTORY_CALIBRATION_MASK);
    }
    else
    {
        context->ptrWdContext[widgetId].status |= (uint32_t)CY_CAPSENSE_WD_FACTORY_CALIBRATION_MASK;
    }
}

#endif

#if (CY_CAPSENSE_LIQUID_LEVEL_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_IsLlwCalibrationValid
****************************************************************************//**
*
* Returns the status of the liquid level calibration the widget, 
* by validating the one-time calibration and the liquid level calibration states.
*
* \note
* This function is available only for the fifth-generation low power CAPSENSE&trade;.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the calibration.
*
* \funcusage
*
* The function is used for one-time calibration. Full example:
*
* -# Add EEPROM configuration:
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_ConfigEmulatedEEPROM
*
* -# Add EEPROM initialization:
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_InitEmulatedEEPROM
*
* -# Liquid level one-time calibration:
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_LiquidLevelOneTimeCalibration
*
* -# Add API to get buffer posiiton in EEPROM:
*    \snippet capsense/snippet/main.c snippet_Cy_CapSense_GetBufferPositionEEPROM
*
*******************************************************************************/
uint8_t Cy_CapSense_IsLlwCalibrationValid (
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    uint8_t result;

    if (CY_CAPSENSE_LLW_READY_MASK == (context->ptrWdConfig[widgetId].centroidConfig & CY_CAPSENSE_LLW_READY_MASK))
    {
        result = 1u; /* Calibration is valid */
    }
    else
    {
        result = 0u; /* Calibration is not valid */
    }

    return result;
}
#endif



#endif /* (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3) || defined(CY_IP_M0S8MSCV3LP)) */


/* [] END OF FILE */
